# Introduction to Pandas
In this notebook, we will learn the basics of Python's **pandas** library. Pandas is a powerful tool for data manipulation and analysis.

We will cover:
- Creating and inspecting DataFrames
- Selecting and filtering data
- Adding and modifying columns
- Aggregation and group operations
- Handling missing data
- Reading from and writing to CSV files

[Docs - DataFrame](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html)

In [25]:
!pip3 install pandas
# import pandas
import pandas as pd
# from pandas import DataFrame

from pathlib import Path

linebreaks = '\n'*2
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)
pd.set_option('display.max_colwidth', None)

Requirement already satisfied: pandas in /home/fabio/Uni/WS2025/UA/.venv/lib/python3.13/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in /home/fabio/Uni/WS2025/UA/.venv/lib/python3.13/site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/fabio/Uni/WS2025/UA/.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/fabio/Uni/WS2025/UA/.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/fabio/Uni/WS2025/UA/.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/fabio/Uni/WS2025/UA/.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

## 1. Creating DataFrames
You can create a DataFrame from a dictionary, list of lists, or read from a CSV file.

In [3]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [24, 27, 22, 32, None],
    'City': ['Vienna', 'Feldkirch', 'Feldkirch', 'Bregenz', None]
}

df = pd.DataFrame(data)
print(df)

df2 = pd.DataFrame([['Alice', 24], ['Bob']], columns=['Name', 'Age'], index=[100, 101])
df2

      Name   Age       City
0    Alice  24.0     Vienna
1      Bob  27.0  Feldkirch
2  Charlie  22.0  Feldkirch
3    David  32.0    Bregenz
4      Eve   NaN       None

      Name   Age
100  Alice  24.0
101    Bob   NaN

## 2. Inspecting DataFrames
- `head()`, `tail()` — view first/last rows
- `info()` — summary of DataFrame
- `describe()` — statistics for numeric columns
- `shape` — number of rows and columns
- `columns` — list column names

In [4]:
print(f"df.head(2):\n{df.head(2)}{linebreaks}")
print(f"df.tail(2):\n{df.tail(2)}{linebreaks}")

print(f"df.info(): ")
df.info()
print(f"{linebreaks}")

print(f"df.describe():\n{df.describe()}{linebreaks}")
print(f"df.shape: {df.shape}{linebreaks}")
print(f"df.columns: {df.columns}")

df.head(2):
    Name   Age       City
0  Alice  24.0     Vienna
1    Bob  27.0  Feldkirch


df.tail(2):
    Name   Age     City
3  David  32.0  Bregenz
4    Eve   NaN     None


df.info():
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     4 non-null      float64
 2   City    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes



df.describe():
             Age
count   4.000000
mean   26.250000
std     4.349329
min    22.000000
25%    23.500000
50%    25.500000
75%    28.250000
max    32.000000


df.shape: (5, 3)


df.columns: Index(['Name', 'Age', 'City'], dtype='object')

In [5]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'Salary': [50000, 60000, 45000, 70000, 52000],
    'Bonus': [5000, 6000, 4000, 7000, 5500]
}
df3 = pd.DataFrame(data)
df3.describe()

             Age        Salary        Bonus
count   5.000000      5.000000     5.000000
mean   26.800000  55400.000000  5500.000000
std     3.962323   9787.747443  1118.033989
min    22.000000  45000.000000  4000.000000
25%    24.000000  50000.000000  5000.000000
50%    27.000000  52000.000000  5500.000000
75%    29.000000  60000.000000  6000.000000
max    32.000000  70000.000000  7000.000000

## 3. Selecting and Filtering Data
- Selecting columns: `df['Column']` or `df.Column`
- Selecting rows: `iloc[]` (by index), `loc[]` (by label)
- Filtering: using boolean conditions

In [6]:
name = df['Name']
print(f"name:\n{name}")
print(f"type:\n{type(name)}{linebreaks}")


row = df.iloc[1]
print(f"row:\n{row}")
print(f"row:\n{type(row)}")

name:
0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object
type:
<class 'pandas.core.series.Series'>


row:
Name          Bob
Age          27.0
City    Feldkirch
Name: 1, dtype: object
row:
<class 'pandas.core.series.Series'>

## 4. loc vs iloc

`loc` gets rows (and/or columns) with particular labels. <br>
`iloc` gets rows (and/or columns) at integer locations.

In [7]:
s = pd.Series(list("abcdefg"), index=[49, 48, 47, 0, 1, 2, "G"]) 
print(f"{s}\n")

print(f"{'-'*5}loc{'-'*6}")
print(f"loc: {s.loc[0]}")
print(f"loc: {s.loc[2]}")
print(f"loc: {s.loc["G"]}\n")

print(f"{'-'*5}iloc{'-'*5}")
print(f"iloc: {s.iloc[0]}")
print(f"iloc: {s.iloc[2]}\n")


print(f"{'-'*14}")
print(s.loc[[0, 2]])
s.iloc[[0, 2]]

49    a
48    b
47    c
0     d
1     e
2     f
G     g
dtype: object

-----loc------
loc: d
loc: f
loc: g

-----iloc-----
iloc: a
iloc: c

--------------
0    d
2    f
dtype: object

49    a
47    c
dtype: object

## 5 - Filter

In [8]:
print(f"{[df['Age'] > 25]}\n\n")
 
new_df = df[df['Age'] > 25]
print(f"type(new_df): {type(new_df)}\n")
new_df

[0    False
1     True
2    False
3     True
4    False
Name: Age, dtype: bool]


type(new_df): <class 'pandas.core.frame.DataFrame'>

    Name   Age       City
1    Bob  27.0  Feldkirch
3  David  32.0    Bregenz

In [9]:
print(df[(df['Age'] > 25) & (df['City'] == "Bregenz")])
df[(df['Age'] < 25) | (df['City'] == "Vienna")]

    Name   Age     City
3  David  32.0  Bregenz

      Name   Age       City
0    Alice  24.0     Vienna
2  Charlie  22.0  Feldkirch

## 6. Adding and Modifying Columns

In [10]:
df

      Name   Age       City
0    Alice  24.0     Vienna
1      Bob  27.0  Feldkirch
2  Charlie  22.0  Feldkirch
3    David  32.0    Bregenz
4      Eve   NaN       None

In [11]:
df['Student'] = [True, False, True, False, False]
print(df)

df['Age'] = df['Age'] + 1
df

      Name   Age       City  Student
0    Alice  24.0     Vienna     True
1      Bob  27.0  Feldkirch    False
2  Charlie  22.0  Feldkirch     True
3    David  32.0    Bregenz    False
4      Eve   NaN       None    False

      Name   Age       City  Student
0    Alice  25.0     Vienna     True
1      Bob  28.0  Feldkirch    False
2  Charlie  23.0  Feldkirch     True
3    David  33.0    Bregenz    False
4      Eve   NaN       None    False

In [12]:
df_new = df.copy()
df_new['City'] = df_new['City'].fillna('Unknown') + " text"
print(df_new)

# df_str_concat = df.assign(City=df['City'].fillna('Unknown') + " text")
# print(df_str_concat)

      Name   Age            City  Student
0    Alice  25.0     Vienna text     True
1      Bob  28.0  Feldkirch text    False
2  Charlie  23.0  Feldkirch text     True
3    David  33.0    Bregenz text    False
4      Eve   NaN    Unknown text    False

In [13]:
df[df['Name'].str.contains('o')]

  Name   Age       City  Student
1  Bob  28.0  Feldkirch    False

In [14]:
print(df[df['City'].str.contains('Br', na=False)])

df[df['Name'].apply(lambda x: len(x) > 3)]

    Name   Age     City  Student
3  David  33.0  Bregenz    False

      Name   Age       City  Student
0    Alice  25.0     Vienna     True
2  Charlie  23.0  Feldkirch     True
3    David  33.0    Bregenz    False

In [15]:
# df.drop([1, 3])

## 7. Aggregation and Group Operations
- `mean()`, `sum()`, `min()`, `max()` — basic statistics
- `groupby()` — group data by column and aggregate

In [16]:
print(f"{df['Age'].mean()}\n")
print(f"{df.groupby('City')['Age'].mean()}\n")


gen_object = df.groupby('Age')['City']
print(gen_object)
# for age, cities in df.groupby('Age')['City']:
#     print(f"Age: {age}")
#     print(cities)

[obj for obj in gen_object]

27.25

City
Bregenz      33.0
Feldkirch    25.5
Vienna       25.0
Name: Age, dtype: float64

<pandas.core.groupby.generic.SeriesGroupBy object at 0x7f31314349d0>

[(23.0,
  2    Feldkirch
  Name: City, dtype: object),
 (25.0,
  0    Vienna
  Name: City, dtype: object),
 (28.0,
  1    Feldkirch
  Name: City, dtype: object),
 (33.0,
  3    Bregenz
  Name: City, dtype: object)]

In [17]:
print(f"Average age: {df['Age'].mean()}\n")                     
print(f"{df.groupby('City')['Age'].mean()}\n")                     
print(f"{df.groupby('Student')['Age'].mean()}\n")                  
print(f"{df.groupby('City')['Age'].agg(['mean', 'count'])}\n")     
print(f"{df.groupby('City').agg({'Age': 'mean', 'Student': 'sum'})}\n")

Average age: 27.25

City
Bregenz      33.0
Feldkirch    25.5
Vienna       25.0
Name: Age, dtype: float64

Student
False    30.5
True     24.0
Name: Age, dtype: float64

           mean  count
City
Bregenz    33.0      1
Feldkirch  25.5      2
Vienna     25.0      1

            Age  Student
City
Bregenz    33.0        0
Feldkirch  25.5        1
Vienna     25.0        1

## 8. Handling Missing Data
- `isnull()` — check for missing values
- `dropna()` — remove missing data
- `fillna()` — fill missing data

In [18]:
print(f"{df.isnull()}\n")

df['Age'] = df['Age'].fillna(df['Age'].mean())
print(f"{df}\n")

df['City'] = df['City'].dropna()
print(f"{df}\n")

df['City'] = df['City'].fillna("Unknown")
print(df)

    Name    Age   City  Student
0  False  False  False    False
1  False  False  False    False
2  False  False  False    False
3  False  False  False    False
4  False   True   True    False

      Name    Age       City  Student
0    Alice  25.00     Vienna     True
1      Bob  28.00  Feldkirch    False
2  Charlie  23.00  Feldkirch     True
3    David  33.00    Bregenz    False
4      Eve  27.25       None    False

      Name    Age       City  Student
0    Alice  25.00     Vienna     True
1      Bob  28.00  Feldkirch    False
2  Charlie  23.00  Feldkirch     True
3    David  33.00    Bregenz    False
4      Eve  27.25        NaN    False

      Name    Age       City  Student
0    Alice  25.00     Vienna     True
1      Bob  28.00  Feldkirch    False
2  Charlie  23.00  Feldkirch     True
3    David  33.00    Bregenz    False
4      Eve  27.25    Unknown    False

## 9. Reading and Writing CSV Files
- `read_csv()` — read CSV
- `to_csv()` — write CSV

In [26]:
df.to_csv(Path('data/example.csv'), index=False)
# sep, columns, header, encoding, na_rep, float_format, line_terminator, quotechar, dateformat

df2 = pd.read_csv(Path('data/example.csv'))
# sep, header, names, usecols, index_col, nrows, skiprows, na_values, dtype, parse_dates, encoding
df2

      Name    Age       City  Student
0    Alice  25.00     Vienna     True
1      Bob  28.00  Feldkirch    False
2  Charlie  23.00  Feldkirch     True
3    David  33.00    Bregenz    False
4      Eve  27.25    Unknown    False

In [20]:
df.to_csv('example.csv', index=False, sep=';')
df_loaded = pd.read_csv('example.csv', sep=';')
print(df_loaded.equals(df))

True

## 10. Join dataframes

In [21]:
# Share a column
first_df = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 28, 23]
})

second_df = pd.DataFrame({
    'ID': [1, 2, 4],
    'City': ['Vienna', 'Linz', 'Graz']
})

df_inner = pd.merge(first_df, second_df, on='ID', how='inner') # left, right,, outer
df_inner

   ID   Name  Age    City
0   1  Alice   25  Vienna
1   2    Bob   28    Linz

In [22]:
# No shared columns - vertical concatenation
a = pd.DataFrame({'Name': ['Alice', 'Bob'], 'Age': [25, 28]})
b = pd.DataFrame({'Name': ['David', 'Eva'], 'Age': [30, 26]})

df_concat = pd.concat([a, b], ignore_index=True)
df_concat

    Name  Age
0  Alice   25
1    Bob   28
2  David   30
3    Eva   26

In [23]:
# horizontal concatenation
x = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie']})
y = pd.DataFrame({'City': ['Vienna', 'Linz', 'Graz']})
pd.concat([x, y], axis=1)

      Name    City
0    Alice  Vienna
1      Bob    Linz
2  Charlie    Graz

In [24]:
# Add 'City' Column from y to x
x['City'] = y['City']
x

      Name    City
0    Alice  Vienna
1      Bob    Linz
2  Charlie    Graz